results/sysbench_all.log
2025-09-23 14:27:11 - Iniciando benchmarks Sysbench...
2025-09-23 14:27:11 - === CENÁRIO READ-HEAVY ===
2025-09-23 14:27:11 - Executando cenário: read_heavy
2025-09-23 14:27:11 - Threads: 20, Duração: 300s, Leitura: 90%, Escrita: 10%
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 20 tps: 302.75 qps: 29100.65 (r/w/o: 27283.34/316.57/1500.73) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 20 tps: 178.29 qps: 17119.52 (r/w/o: 16049.77/198.45/871.30) lat (ms,95%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 20 tps: 164.95 qps: 15824.25 (r/w/o: 14834.52/191.80/797.93) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 20 tps: 251.51 qps: 24150.81 (r/w/o: 22642.01/309.07/1199.73) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 20 tps: 267.35 qps: 25666.16 (r/w/o: 24061.94/343.92/1260.30) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 20 tps: 258.73 qps: 24830.30 (r/w/o: 23278.04/355.20/1197.07) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 20 tps: 247.79 qps: 23793.72 (r/w/o: 22306.99/354.78/1131.95) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 20 tps: 232.08 qps: 22277.01 (r/w/o: 20884.50/346.40/1046.11) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 20 tps: 221.09 qps: 21230.73 (r/w/o: 19904.25/343.36/983.12) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 20 tps: 221.64 qps: 21270.40 (r/w/o: 19940.53/353.15/976.72) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            6336630
        write:                           93417
        other:                           329025
        total:                           6759072
    transactions:                        70407  (234.64 per sec.)
    queries:                             6759072 (22525.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      234.6376
    time elapsed:                        300.0670s
    total number of events:              70407

Latency (ms):
         min:                                   13.00
         avg:                                   85.22
         max:                                 2002.01
         95th percentile:                      161.51
         sum:                              6000430.24

Threads fairness:
    events (avg/stddev):           3520.3500/36.05
    execution time (avg/stddev):   300.0215/0.01

2025-09-23 14:32:12 - === CENÁRIO WRITE-HEAVY ===
2025-09-23 14:32:12 - Executando cenário: write_heavy
2025-09-23 14:32:12 - Threads: 20, Duração: 300s, Leitura: 10%, Escrita: 90%
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 20 tps: 919.34 qps: 29428.03 (r/w/o: 9198.56/5183.04/15046.42) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 20 tps: 928.21 qps: 29702.87 (r/w/o: 9281.52/6423.02/13998.33) lat (ms,95%): 34.33 err/s: 0.03 reconn/s: 0.00
[ 90s ] thds: 20 tps: 905.41 qps: 28974.45 (r/w/o: 9055.10/7291.06/12628.30) lat (ms,95%): 35.59 err/s: 0.03 reconn/s: 0.00
[ 120s ] thds: 20 tps: 872.68 qps: 27926.39 (r/w/o: 8726.98/7933.57/11265.85) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 20 tps: 815.77 qps: 26106.11 (r/w/o: 8158.41/8159.94/9787.76) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 20 tps: 825.58 qps: 26414.48 (r/w/o: 8254.00/8902.56/9257.92) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 20 tps: 811.99 qps: 25985.71 (r/w/o: 8120.66/9308.99/8556.06) lat (ms,95%): 39.65 err/s: 0.03 reconn/s: 0.00
[ 240s ] thds: 20 tps: 789.60 qps: 25268.34 (r/w/o: 7897.07/9560.03/7811.24) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 20 tps: 670.38 qps: 21451.74 (r/w/o: 6702.97/8494.74/6254.04) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 20 tps: 634.09 qps: 20291.30 (r/w/o: 6342.07/8321.85/5627.37) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2452190
        write:                           2387618
        other:                           3007194
        total:                           7847002
    transactions:                        245216 (817.29 per sec.)
    queries:                             7847002 (26153.46 per sec.)
    ignored errors:                      3      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      817.2863
    time elapsed:                        300.0369s
    total number of events:              245216

Latency (ms):
         min:                                    6.60
         avg:                                   24.47
         max:                                 1863.73
         95th percentile:                       41.10
         sum:                              5999494.51

Threads fairness:
    events (avg/stddev):           12260.8000/65.69
    execution time (avg/stddev):   299.9747/0.01

2025-09-23 14:37:12 - === CENÁRIO BALANCEADO ===
2025-09-23 14:37:12 - Executando cenário: balanced
2025-09-23 14:37:12 - Threads: 20, Duração: 300s, Leitura: 50%, Escrita: 50%
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 20 tps: 162.20 qps: 10399.64 (r/w/o: 8127.85/1324.35/947.43) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 20 tps: 170.14 qps: 10894.13 (r/w/o: 8512.06/1402.58/979.49) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 20 tps: 215.78 qps: 13808.69 (r/w/o: 10787.31/1786.57/1234.81) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 20 tps: 206.08 qps: 13190.50 (r/w/o: 10304.94/1725.60/1159.96) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 20 tps: 203.56 qps: 13022.57 (r/w/o: 10174.03/1722.89/1125.65) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 20 tps: 195.03 qps: 12484.71 (r/w/o: 9753.79/1665.47/1065.45) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 20 tps: 200.76 qps: 12853.18 (r/w/o: 10042.09/1729.94/1081.15) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 20 tps: 204.53 qps: 13088.75 (r/w/o: 10225.79/1775.13/1087.83) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 20 tps: 211.70 qps: 13543.00 (r/w/o: 10578.85/1850.09/1114.06) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 20 tps: 194.89 qps: 12474.45 (r/w/o: 9746.74/1714.41/1013.30) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2948050
        write:                           501096
        other:                           324358
        total:                           3773504
    transactions:                        58961  (196.48 per sec.)
    queries:                             3773504 (12574.70 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      196.4798
    time elapsed:                        300.0869s
    total number of events:              58961

Latency (ms):
         min:                                   27.10
         avg:                                  101.77
         max:                                  566.63
         95th percentile:                      189.93
         sum:                              6000617.34

Threads fairness:
    events (avg/stddev):           2948.0500/29.88
    execution time (avg/stddev):   300.0309/0.02

2025-09-23 14:42:12 - Benchmarks Sysbench concluídos!